---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Plumbing.PlumbingUtils
source: html/6334fcc6-7e95-51a1-0e2a-2c728bd2719c.htm
---
# PlumbingUtils Members

Breaks the pipe curve into two parts at the given position.